tsung/bidder_test.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="demo.kqsu4hptxs.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="item_index" probability="100" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/users/sign' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="50">
        <var name="nth_user" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="user_id" re="[Ll]ocation: http://.*/users/(.*)\r" />
        <http url='/users/sign' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;user[email]=%%_nth_user%%@%%_nth_user%%&amp;user[password]=123456" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

      <request>
        <dyn_variable name='authenticity_token'></dyn_variable>
        <http url='/bid_items/new' version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
                  code='fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        re:replace(Val,"[+]","%2B",[global, {return,list}]) end.'>
                  <var name="authenticity_token" />
      </setdynvars>

      <request subst="true" >
        <dyn_variable name="item_id" re="[Ll]ocation: http://.*/bid_items/(.*)\r" />
        <http url='/bid_items' version='1.1' contents="authenticity_token=%%_authenticity_token%%&amp;bid_item[item_name]=1234" content_type="application/x-www-form-urlencoded" method='POST'></http>
      </request>

    </session>
  </sessions>
</tsung>